Public Attributes | List of all members
API_LinkType Struct Reference
Element Manager
Describes a link for cameras. More...
#include <APIdefs_Elements.h>
 Public Attributes
 Int32  | camInd
Index of the target camera.
 short  | status
Status of the target camera. (Active?)
 short  | pen
Pen attribute index.
 API_Coord  | connPoint
Connection point coordinates between the current camera and the one defined by camInd.
Detailed Description
Describes a link for cameras.